export default {
    app: {
        title: 'Ban-DERA',
        subtitle: '<strong>BAN</strong> <strong>D</strong>igital <strong>E</strong>nvironment for <strong>R</strong>ussian <strong>A</strong>ssets'
    },
    targets: 'Количество сайтов',
    showTargets: 'Показать список',
    content: '<p>DoS-атака (Denial-of-service) - одним из наиболее распространенных методов нападения - нагрузка атакуемого сервера большим количеством внешних запросов.</p>' +
        '<p>С Вашего компьютера будет отправляться бесконечное количество запросов на российские сайты, что может отправить их в след за русским военным кораблем. То есть, НАХУЙ. Просто оставьте скрипт работающим. Если какой-то сайт будет определен как "отваленный" - он будет заменен другим, то есть Ваша атака будет постоянной.</p>' +
        '<p><strong>ВНИМАНИЕ!</strong> Так как этот скрипт инициирует большое количество запросов за короткое время, его запуск может замедлить работу Вашего компьютера и использовать большое количество трафика. Не рекомендуется использовать его из мобильных сетей, где обычно трафик ограничен.</p>' +
        '<p class="fst-italic">Это - сайт с отрытым кодом (<a href="https://github.com/vnestoruk/ban-dera" target="_blank">Посмотреть на Github</a>). Присоединяйтесь к разработке, или в <a target="_blank" href="https://t.me/ban_dera_com">Telegram группу</a> и делитесь своими идеями по улучшению и следите за обновлениями.</p>',
    donation: {
        army: {
            button: 'Помощь для ВСУ',
            title: 'Помощь воинам Украины'
        },
        support: {
            button: 'Помочь проэкту',
            title: '...но сначала помоги армии',
            content: '<p>К сожалению, этот сайт падает время от времени. Причиной этого обычно является "волна" новых пользователей, которую дешевый хостинг не выдерживает. А еще, в планах сделать серверную проверку сайтов под прицелом и их реальных IP-адресов для того, чтобы обойти их защиту (например, такой как CloudFlare). Для этого нам нужен более мощный сервер.</p>' +
                '<p>Если у Вас есть желание помочь этому маленькому проекту, Вы можете сделать это тоже. Спасибо.</p>'
        }
    },
    table: {
        url: 'URL',
        requests: 'Зпросов',
        actions: 'Действия'
    },
    copy: 'Копировать',
    replace: 'Заменить',
    blackList: 'Исключить',
    night: 'Ночной режим',
    search: 'Поиск...',
    filter: 'Всего отфильтровано',
    settings: 'Настройки',
    attackSpeed: {
        label: 'Скорость',
        options: [
            'Меч (1 запросов/с)',
            'Коктейль Молотова (5 запросов/с)',
            'Пистолет (10 запросов/с)',
            'Автомат (20 запросов/с)',
            'Танк (50 запросов/с)',
            'Байрактар (100 запросов/с)',
        ]
    },
    maxTargets: {
        label: 'Максимум одновременных целей',
        options: [
            '1 сайт',
            '5 сайтов',
            '10 сайтов',
            '20 сайтов',
            '50 сайтов',
            '100 сайтов'
        ]
    }
}
