export default {
    app: {
        title: 'Ban-DERA',
        subtitle: '<strong>BAN</strong> <strong>D</strong>igital <strong>E</strong>nvironment for <strong>R</strong>ussian <strong>A</strong>ssets'
    },
    targets: 'Кількість сайтів у базі',
    showTargets: 'Показати список цілей',
    helpArmy: 'Допомогa для ЗСУ',
    content: '<p>DoS-атака (Denial-of-service) - одним із найпоширеніших методів нападу, насичення атакованого сервера великою кількістю зовнішніх запитів.</p>' +
        '<p>З Вашого комп\'ютера буде надсилатись нескінченна кількість запитів на російські сайти, що може відправити їх в слід за рускім воєнним кораблем. Тобто, НАХУЙ. Просто залишіть скрипт працюючим. Якщо якийсь сайт буде визначено як "відвалений" - його буде замінено на інший, тобто Ваша атака буде постійною.</p>' +
        '<p><strong>УВАГА!</strong> Так як цей скрипт ініціює велику кількість запитів за короткий проміжок часу, його запуск може сповільнити роботу Вашого комп\'ютера та використати велику кількість трафіку. Не рекомендується використовувати його з мобільних мереж, де, зазвичай, трафік обмежений.</p>' +
        '<p class="fst-italic">Це - сайт з відкритим кодом (<a href="https://github.com/vnestoruk/ban-dera" target="_blank">Переглянути на Github</a>). Долучайтесь до розробки, або <a target="_blank" href="https://t.me/ban_dera_com">групи в Telegram</a> і діліться своїми ідеями щодо покращення та слідкуйте за оновленнями.</p>',
    armyBankAccount:
        '<p>Bank: National Bank of Ukraine</p>' +
        '<p>MFO 300001</p>' +
        '<p>Account No. UA843000010000000047330992708</p>' +
        '<p>EDRPOU Code 00032106</p>' +
        '<p>Payee: National Bank of Ukraine</p>',
    table: {
        url: 'URL',
        requests: 'Запитів',
        success: 'Успішних',
        failed: 'Помилкових',
        rate: 'Відношення'
    },
    search: 'Пошук...',
    filter: 'Всього відфільтровано'
}
